In [1]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
df.drop(['PassengerId', 'Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [3]:
target = df.Survived
inputs = df.drop('Survived',axis='columns')

In [4]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [5]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [8]:
inputs.isnull().sum()

Pclass      0
Age       177
Fare        0
female      0
male        0
dtype: int64

In [9]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [11]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [34]:
 from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [35]:
len(X_train)

712

In [36]:
len(X_test)

179

In [37]:
len(inputs)

891

In [38]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [39]:
model.fit(X_train, y_train)

GaussianNB()

In [40]:
model.score(X_test,y_test)

0.7821229050279329

In [41]:
X_test[:10]

     Pclass        Age      Fare  female  male
306       1  29.699118  110.8833       1     0
224       1  38.000000   90.0000       0     1
433       3  17.000000    7.1250       0     1
244       3  30.000000    7.2250       0     1
464       3  29.699118    8.0500       0     1
583       1  36.000000   40.1250       0     1
214       3  29.699118    7.7500       0     1
82        3  29.699118    7.7875       1     0
122       2  32.500000   30.0708       0     1
721       3  17.000000    7.0542       0     1

In [42]:
y_test[:10]

306    1
224    1
433    0
244    0
464    0
583    0
214    0
82     1
122    0
721    0
Name: Survived, dtype: int64

In [43]:
model.predict(X_test[:10])

array([1, 1, 0, 0, 0, 0, 0, 1, 0, 0], dtype=int64)

In [44]:
model.predict_proba(X_test[:10])

array([[1.21012253e-04, 9.99878988e-01],
       [4.81164927e-01, 5.18835073e-01],
       [9.89965715e-01, 1.00342848e-02],
       [9.92309826e-01, 7.69017388e-03],
       [9.92315605e-01, 7.68439472e-03],
       [8.90094025e-01, 1.09905975e-01],
       [9.92306011e-01, 7.69398863e-03],
       [7.28744232e-02, 9.27125577e-01],
       [9.78617165e-01, 2.13828351e-02],
       [9.89962293e-01, 1.00377069e-02]])